app/controllers/admin/accounts_controller.rb

  def index
    @accounts = User.all
---
SELECT "users".* FROM "users"

  def find_account
    @account = User.find_by id: params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]